app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index

    if(params[:categoria]!=nil)
     # @products = Product.find(:all, :conditions=>{:categoria=>[params[:categoria]]})
      @products =Product.search2(params[:search],params[:categoria])
    elsif (params[:user_id]!=nil)
      #filtro por los productos que posee un proveedor
      @products =Product.misproductos(params[:user_id])
    else

      @products =Product.search(params[:search])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @product = Product.find(params[:id])
    #puts YAML::dump(@product.user_id)
    if (@product.user_id!=nil)
      @user= Product.findUser(@product.user_id)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("categoria", "codigo", "created_at", "extension", "nombre", "precio", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "nombre" = 'vendo algo muy economico', "categoria" = 'salud', "updated_at" = '2013-06-11 22:21:15.066491' WHERE "products"."id" = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])